noorhaq/GeneBird/GeneBird_Tiva_Tm4c123gxl/src/driverlib/rom_map.h
//*****************************************************************************
//
// rom_map.h - Macros to facilitate calling functions in the ROM when they are
//             available and in flash otherwise.
//
// Copyright (c) 2008-2017 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
// 
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the  
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// 
// This is part of revision 2.1.4.178 of the Tiva Peripheral Driver Library.
//
//*****************************************************************************

#ifndef __DRIVERLIB_ROM_MAP_H__
#define __DRIVERLIB_ROM_MAP_H__

//*****************************************************************************
//
// Macros for the ADC API.
//
//*****************************************************************************
#ifdef ROM_ADCSequenceDataGet
#define MAP_ADCSequenceDataGet                                                \
        ROM_ADCSequenceDataGet
#else
#define MAP_ADCSequenceDataGet                                                \
        ADCSequenceDataGet
#endif
#ifdef ROM_ADCIntDisable
#define MAP_ADCIntDisable                                                     \
        ROM_ADCIntDisable
#else
#define MAP_ADCIntDisable                                                     \
        ADCIntDisable
#endif
#ifdef ROM_ADCIntEnable
#define MAP_ADCIntEnable                                                      \
        ROM_ADCIntEnable
#else
#define MAP_ADCIntEnable                                                      \
        ADCIntEnable
#endif
#ifdef ROM_ADCIntStatus
#define MAP_ADCIntStatus                                                      \
        ROM_ADCIntStatus
#else
#define MAP_ADCIntStatus                                                      \
        ADCIntStatus
#endif
#ifdef ROM_ADCIntClear
#define MAP_ADCIntClear                                                       \
        ROM_ADCIntClear
#else
#define MAP_ADCIntClear                                                       \
        ADCIntClear
#endif
#ifdef ROM_ADCSequenceEnable
#define MAP_ADCSequenceEnable                                                 \
        ROM_ADCSequenceEnable
#else
#define MAP_ADCSequenceEnable                                                 \
        ADCSequenceEnable
#endif
#ifdef ROM_ADCSequenceDisable
#define MAP_ADCSequenceDisable                                                \
        ROM_ADCSequenceDisable
#else
#define MAP_ADCSequenceDisable                                                \
        ADCSequenceDisable
#endif
#ifdef ROM_ADCSequenceConfigure
#define MAP_ADCSequenceConfigure                                              \
        ROM_ADCSequenceConfigure
#else
#define MAP_ADCSequenceConfigure                                              \
        ADCSequenceConfigure
#endif
#ifdef ROM_ADCSequenceStepConfigure
#define MAP_ADCSequenceStepConfigure                                          \
        ROM_ADCSequenceStepConfigure
#else
#define MAP_ADCSequenceStepConfigure                                          \
        ADCSequenceStepConfigure
#endif
#ifdef ROM_ADCSequenceOverflow
#define MAP_ADCSequenceOverflow                                               \
        ROM_ADCSequenceOverflow
#else
#define MAP_ADCSequenceOverflow                                               \
        ADCSequenceOverflow
#endif
#ifdef ROM_ADCSequenceOverflowClear
#define MAP_ADCSequenceOverflowClear                                          \
        ROM_ADCSequenceOverflowClear
#else
#define MAP_ADCSequenceOverflowClear                                          \
        ADCSequenceOverflowClear
#endif
#ifdef ROM_ADCSequenceUnderflow
#define MAP_ADCSequenceUnderflow                                              \
        ROM_ADCSequenceUnderflow
#else
#define MAP_ADCSequenceUnderflow                                              \
        ADCSequenceUnderflow
#endif
#ifdef ROM_ADCSequenceUnderflowClear
#define MAP_ADCSequenceUnderflowClear                                         \
        ROM_ADCSequenceUnderflowClear
#else
#define MAP_ADCSequenceUnderflowClear                                         \
        ADCSequenceUnderflowClear
#endif
#ifdef ROM_ADCProcessorTrigger
#define MAP_ADCProcessorTrigger                                               \
        ROM_ADCProcessorTrigger
#else
#define MAP_ADCProcessorTrigger                                               \
        ADCProcessorTrigger
#endif
#ifdef ROM_ADCHardwareOversampleConfigure
#define MAP_ADCHardwareOversampleConfigure                                    \
        ROM_ADCHardwareOversampleConfigure
#else
#define MAP_ADCHardwareOversampleConfigure                                    \
        ADCHardwareOversampleConfigure
#endif
#ifdef ROM_ADCComparatorConfigure
#define MAP_ADCComparatorConfigure                                            \
        ROM_ADCComparatorConfigure
#else
#define MAP_ADCComparatorConfigure                                            \
        ADCComparatorConfigure
#endif
#ifdef ROM_ADCComparatorRegionSet
#define MAP_ADCComparatorRegionSet                                            \
        ROM_ADCComparatorRegionSet
#else
#define MAP_ADCComparatorRegionSet                                            \
        ADCComparatorRegionSet
#endif
#ifdef ROM_ADCComparatorReset
#define MAP_ADCComparatorReset                                                \
        ROM_ADCComparatorReset
#else
#define MAP_ADCComparatorReset                                                \
        ADCComparatorReset
#endif
#ifdef ROM_ADCComparatorIntDisable
#define MAP_ADCComparatorIntDisable                                           \
        ROM_ADCComparatorIntDisable
#else
#define MAP_ADCComparatorIntDisable                                           \
        ADCComparatorIntDisable
#endif
#ifdef ROM_ADCComparatorIntEnable
#define MAP_ADCComparatorIntEnable                                            \
        ROM_ADCComparatorIntEnable
#else
#define MAP_ADCComparatorIntEnable                                            \
        ADCComparatorIntEnable
#endif
#ifdef ROM_ADCComparatorIntStatus
#define MAP_ADCComparatorIntStatus                                            \
        ROM_ADCComparatorIntStatus
#else
#define MAP_ADCComparatorIntStatus                                            \
        ADCComparatorIntStatus
#endif
#ifdef ROM_ADCComparatorIntClear
#define MAP_ADCComparatorIntClear                                             \
        ROM_ADCComparatorIntClear
#else
#define MAP_ADCComparatorIntClear                                             \
        ADCComparatorIntClear
#endif
#ifdef ROM_ADCReferenceSet
#define MAP_ADCReferenceSet                                                   \
        ROM_ADCReferenceSet
#else
#define MAP_ADCReferenceSet                                                   \
        ADCReferenceSet
#endif
#ifdef ROM_ADCReferenceGet
#define MAP_ADCReferenceGet                                                   \
        ROM_ADCReferenceGet
#else
#define MAP_ADCReferenceGet                                                   \
        ADCReferenceGet
#endif
#ifdef ROM_ADCPhaseDelaySet
#define MAP_ADCPhaseDelaySet                                                  \
        ROM_ADCPhaseDelaySet
#else
#define MAP_ADCPhaseDelaySet                                                  \
        ADCPhaseDelaySet
#endif
#ifdef ROM_ADCPhaseDelayGet
#define MAP_ADCPhaseDelayGet                                                  \
        ROM_ADCPhaseDelayGet
#else
#define MAP_ADCPhaseDelayGet                                                  \
        ADCPhaseDelayGet
#endif
#ifdef ROM_ADCIntClearEx
#define MAP_ADCIntClearEx                                                     \
        ROM_ADCIntClearEx
#else
#define MAP_ADCIntClearEx                                                     \
        ADCIntClearEx
#endif
#ifdef ROM_ADCIntDisableEx
#define MAP_ADCIntDisableEx                                                   \
        ROM_ADCIntDisableEx
#else
#define MAP_ADCIntDisableEx                                                   \
        ADCIntDisableEx
#endif
#ifdef ROM_ADCIntEnableEx
#define MAP_ADCIntEnableEx                                                    \
        ROM_ADCIntEnableEx
#else
#define MAP_ADCIntEnableEx                                                    \
        ADCIntEnableEx
#endif
#ifdef ROM_ADCIntStatusEx
#define MAP_ADCIntStatusEx                                                    \
        ROM_ADCIntStatusEx
#else
#define MAP_ADCIntStatusEx                                                    \
        ADCIntStatusEx
#endif
#ifdef ROM_ADCSequenceDMAEnable
#define MAP_ADCSequenceDMAEnable                                              \
        ROM_ADCSequenceDMAEnable
#else
#define MAP_ADCSequenceDMAEnable                                              \
        ADCSequenceDMAEnable
#endif
#ifdef ROM_ADCSequenceDMADisable
#define MAP_ADCSequenceDMADisable                                             \
        ROM_ADCSequenceDMADisable
#else
#define MAP_ADCSequenceDMADisable                                             \
        ADCSequenceDMADisable
#endif
#ifdef ROM_ADCBusy
#define MAP_ADCBusy                                                           \
        ROM_ADCBusy
#else
#define MAP_ADCBusy                                                           \
        ADCBusy
#endif

//*****************************************************************************
//
// Macros for the AES API.
//
//*****************************************************************************
#ifdef ROM_AESIntStatus
#define MAP_AESIntStatus                                                      \
        ROM_AESIntStatus
#else
#define MAP_AESIntStatus                                                      \
        AESIntStatus
#endif
#ifdef ROM_AESAuthLengthSet
#define MAP_AESAuthLengthSet                                                  \
        ROM_AESAuthLengthSet
#else
#define MAP_AESAuthLengthSet                                                  \
        AESAuthLengthSet
#endif
#ifdef ROM_AESConfigSet
#define MAP_AESConfigSet                                                      \
        ROM_AESConfigSet
#else
#define MAP_AESConfigSet                                                      \
        AESConfigSet
#endif
#ifdef ROM_AESDataAuth
#define MAP_AESDataAuth                                                       \
        ROM_AESDataAuth
#else
#define MAP_AESDataAuth                                                       \
        AESDataAuth
#endif
#ifdef ROM_AESDataProcess
#define MAP_AESDataProcess                                                    \
        ROM_AESDataProcess
#else
#define MAP_AESDataProcess                                                    \
        AESDataProcess
#endif
#ifdef ROM_AESDataProcessAuth
#define MAP_AESDataProcessAuth                                                \
        ROM_AESDataProcessAuth
#else
#define MAP_AESDataProcessAuth                                                \
        AESDataProcessAuth
#endif
#ifdef ROM_AESDataRead
#define MAP_AESDataRead                                                       \
        ROM_AESDataRead
#else
#define MAP_AESDataRead                                                       \
        AESDataRead
#endif
#ifdef ROM_AESDataReadNonBlocking
#define MAP_AESDataReadNonBlocking                                            \
        ROM_AESDataReadNonBlocking
#else
#define MAP_AESDataReadNonBlocking                                            \
        AESDataReadNonBlocking
#endif
#ifdef ROM_AESDataWrite
#define MAP_AESDataWrite                                                      \
        ROM_AESDataWrite
#else
#define MAP_AESDataWrite                                                      \
        AESDataWrite
#endif
#ifdef ROM_AESDataWriteNonBlocking
#define MAP_AESDataWriteNonBlocking                                           \
        ROM_AESDataWriteNonBlocking
#else
#define MAP_AESDataWriteNonBlocking                                           \
        AESDataWriteNonBlocking
#endif
#ifdef ROM_AESDMADisable
#define MAP_AESDMADisable                                                     \
        ROM_AESDMADisable
#else
#define MAP_AESDMADisable                                                     \
        AESDMADisable
#endif
#ifdef ROM_AESDMAEnable
#define MAP_AESDMAEnable                                                      \
        ROM_AESDMAEnable
#else
#define MAP_AESDMAEnable                                                      \
        AESDMAEnable
#endif
#ifdef ROM_AESIntClear
#define MAP_AESIntClear                                                       \
        ROM_AESIntClear
#else
#define MAP_AESIntClear                                                       \
        AESIntClear
#endif
#ifdef ROM_AESIntDisable
#define MAP_AESIntDisable                                                     \
        ROM_AESIntDisable
#else
#define MAP_AESIntDisable                                                     \
        AESIntDisable
#endif
#ifdef ROM_AESIntEnable
#define MAP_AESIntEnable                                                      \
        ROM_AESIntEnable
#else
#define MAP_AESIntEnable                                                      \
        AESIntEnable
#endif
#ifdef ROM_AESIVSet
#define MAP_AESIVSet                                                          \
        ROM_AESIVSet
#else
#define MAP_AESIVSet                                                          \
        AESIVSet
#endif
#ifdef ROM_AESKey1Set
#define MAP_AESKey1Set                                                        \
        ROM_AESKey1Set
#else
#define MAP_AESKey1Set                                                        \
        AESKey1Set
#endif
#ifdef ROM_AESKey2Set
#define MAP_AESKey2Set                                                        \
        ROM_AESKey2Set
#else
#define MAP_AESKey2Set                                                        \
        AESKey2Set
#endif
#ifdef ROM_AESKey3Set
#define MAP_AESKey3Set                                                        \
        ROM_AESKey3Set
#else
#define MAP_AESKey3Set                                                        \
        AESKey3Set
#endif
#ifdef ROM_AESLengthSet
#define MAP_AESLengthSet                                                      \
        ROM_AESLengthSet
#else
#define MAP_AESLengthSet                                                      \
        AESLengthSet
#endif
#ifdef ROM_AESReset
#define MAP_AESReset                                                          \
        ROM_AESReset
#else
#define MAP_AESReset                                                          \
        AESReset
#endif
#ifdef ROM_AESTagRead
#define MAP_AESTagRead                                                        \
        ROM_AESTagRead
#else
#define MAP_AESTagRead                                                        \
        AESTagRead
#endif
#ifdef ROM_AESIVRead
#define MAP_AESIVRead                                                         \
        ROM_AESIVRead
#else
#define MAP_AESIVRead                                                         \
        AESIVRead
#endif

//*****************************************************************************
//
// Macros for the CAN API.
//
//*****************************************************************************
#ifdef ROM_CANIntClear
#define MAP_CANIntClear                                                       \
        ROM_CANIntClear
#else
#define MAP_CANIntClear                                                       \
        CANIntClear
#endif
#ifdef ROM_CANInit
#define MAP_CANInit                                                           \
        ROM_CANInit
#else
#define MAP_CANInit                                                           \
        CANInit
#endif
#ifdef ROM_CANEnable
#define MAP_CANEnable                                                         \
        ROM_CANEnable
#else
#define MAP_CANEnable                                                         \
        CANEnable
#endif
#ifdef ROM_CANDisable
#define MAP_CANDisable                                                        \
        ROM_CANDisable
#else
#define MAP_CANDisable                                                        \
        CANDisable
#endif
#ifdef ROM_CANBitTimingSet
#define MAP_CANBitTimingSet                                                   \
        ROM_CANBitTimingSet
#else
#define MAP_CANBitTimingSet                                                   \
        CANBitTimingSet
#endif
#ifdef ROM_CANBitTimingGet
#define MAP_CANBitTimingGet                                                   \
        ROM_CANBitTimingGet
#else
#define MAP_CANBitTimingGet                                                   \
        CANBitTimingGet
#endif
#ifdef ROM_CANMessageSet
#define MAP_CANMessageSet                                                     \
        ROM_CANMessageSet
#else
#define MAP_CANMessageSet                                                     \
        CANMessageSet
#endif
#ifdef ROM_CANMessageGet
#define MAP_CANMessageGet                                                     \
        ROM_CANMessageGet
#else
#define MAP_CANMessageGet                                                     \
        CANMessageGet
#endif
#ifdef ROM_CANStatusGet
#define MAP_CANStatusGet                                                      \
        ROM_CANStatusGet
#else
#define MAP_CANStatusGet                                                      \
        CANStatusGet
#endif
#ifdef ROM_CANMessageClear
#define MAP_CANMessageClear                                                   \
        ROM_CANMessageClear
#else
#define MAP_CANMessageClear                                                   \
        CANMessageClear
#endif
#ifdef ROM_CANIntEnable
#define MAP_CANIntEnable                                                      \
        ROM_CANIntEnable
#else
#define MAP_CANIntEnable                                                      \
        CANIntEnable
#endif
#ifdef ROM_CANIntDisable
#define MAP_CANIntDisable                                                     \
        ROM_CANIntDisable
#else
#define MAP_CANIntDisable                                                     \
        CANIntDisable
#endif
#ifdef ROM_CANIntStatus
#define MAP_CANIntStatus                                                      \
        ROM_CANIntStatus
#else
#define MAP_CANIntStatus                                                      \
        CANIntStatus
#endif
#ifdef ROM_CANRetryGet
#define MAP_CANRetryGet                                                       \
        ROM_CANRetryGet
#else
#define MAP_CANRetryGet                                                       \
        CANRetryGet
#endif
#ifdef ROM_CANRetrySet
#define MAP_CANRetrySet                                                       \
        ROM_CANRetrySet
#else
#define MAP_CANRetrySet                                                       \
        CANRetrySet
#endif
#ifdef ROM_CANErrCntrGet
#define MAP_CANErrCntrGet                                                     \
        ROM_CANErrCntrGet
#else
#define MAP_CANErrCntrGet                                                     \
        CANErrCntrGet
#endif
#ifdef ROM_CANBitRateSet
#define MAP_CANBitRateSet                                                     \
        ROM_CANBitRateSet
#else
#define MAP_CANBitRateSet                                                     \
        CANBitRateSet
#endif

//*****************************************************************************
//
// Macros for the Comparator API.
//
//*****************************************************************************
#ifdef ROM_ComparatorIntClear
#define MAP_ComparatorIntClear                                                \
        ROM_ComparatorIntClear
#else
#define MAP_ComparatorIntClear                                                \
        ComparatorIntClear
#endif
#ifdef ROM_ComparatorConfigure
#define MAP_ComparatorConfigure                                               \
        ROM_ComparatorConfigure
#else
#define MAP_ComparatorConfigure                                               \
        ComparatorConfigure
#endif
#ifdef ROM_ComparatorRefSet
#define MAP_ComparatorRefSet                                                  \
        ROM_ComparatorRefSet
#else
#define MAP_ComparatorRefSet                                                  \
        ComparatorRefSet
#endif
#ifdef ROM_ComparatorValueGet
#define MAP_ComparatorValueGet                                                \
        ROM_ComparatorValueGet
#else
#define MAP_ComparatorValueGet                                                \
        ComparatorValueGet
#endif
#ifdef ROM_ComparatorIntEnable
#define MAP_ComparatorIntEnable                                               \
        ROM_ComparatorIntEnable
#else
#define MAP_ComparatorIntEnable                                               \
        ComparatorIntEnable
#endif
#ifdef ROM_ComparatorIntDisable
#define MAP_ComparatorIntDisable                                              \
        ROM_ComparatorIntDisable
#else
#define MAP_ComparatorIntDisable                                              \
        ComparatorIntDisable
#endif
#ifdef ROM_ComparatorIntStatus
#define MAP_ComparatorIntStatus                                               \
        ROM_ComparatorIntStatus
#else
#define MAP_ComparatorIntStatus                                               \
        ComparatorIntStatus
#endif

