noorhaq/GeneBird/GeneBird_Tiva_Tm4c123gxl/src/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the uDMA API.
//
//*****************************************************************************
#ifdef ROM_uDMAChannelTransferSet
#define MAP_uDMAChannelTransferSet                                            \
        ROM_uDMAChannelTransferSet
#else
#define MAP_uDMAChannelTransferSet                                            \
        uDMAChannelTransferSet
#endif
#ifdef ROM_uDMAEnable
#define MAP_uDMAEnable                                                        \
        ROM_uDMAEnable
#else
#define MAP_uDMAEnable                                                        \
        uDMAEnable
#endif
#ifdef ROM_uDMADisable
#define MAP_uDMADisable                                                       \
        ROM_uDMADisable
#else
#define MAP_uDMADisable                                                       \
        uDMADisable
#endif
#ifdef ROM_uDMAErrorStatusGet
#define MAP_uDMAErrorStatusGet                                                \
        ROM_uDMAErrorStatusGet
#else
#define MAP_uDMAErrorStatusGet                                                \
        uDMAErrorStatusGet
#endif
#ifdef ROM_uDMAErrorStatusClear
#define MAP_uDMAErrorStatusClear                                              \
        ROM_uDMAErrorStatusClear
#else
#define MAP_uDMAErrorStatusClear                                              \
        uDMAErrorStatusClear
#endif
#ifdef ROM_uDMAChannelEnable
#define MAP_uDMAChannelEnable                                                 \
        ROM_uDMAChannelEnable
#else
#define MAP_uDMAChannelEnable                                                 \
        uDMAChannelEnable
#endif
#ifdef ROM_uDMAChannelDisable
#define MAP_uDMAChannelDisable                                                \
        ROM_uDMAChannelDisable
#else
#define MAP_uDMAChannelDisable                                                \
        uDMAChannelDisable
#endif
#ifdef ROM_uDMAChannelIsEnabled
#define MAP_uDMAChannelIsEnabled                                              \
        ROM_uDMAChannelIsEnabled
#else
#define MAP_uDMAChannelIsEnabled                                              \
        uDMAChannelIsEnabled
#endif
#ifdef ROM_uDMAControlBaseSet
#define MAP_uDMAControlBaseSet                                                \
        ROM_uDMAControlBaseSet
#else
#define MAP_uDMAControlBaseSet                                                \
        uDMAControlBaseSet
#endif
#ifdef ROM_uDMAControlBaseGet
#define MAP_uDMAControlBaseGet                                                \
        ROM_uDMAControlBaseGet
#else
#define MAP_uDMAControlBaseGet                                                \
        uDMAControlBaseGet
#endif
#ifdef ROM_uDMAChannelRequest
#define MAP_uDMAChannelRequest                                                \
        ROM_uDMAChannelRequest
#else
#define MAP_uDMAChannelRequest                                                \
        uDMAChannelRequest
#endif
#ifdef ROM_uDMAChannelAttributeEnable
#define MAP_uDMAChannelAttributeEnable                                        \
        ROM_uDMAChannelAttributeEnable
#else
#define MAP_uDMAChannelAttributeEnable                                        \
        uDMAChannelAttributeEnable
#endif
#ifdef ROM_uDMAChannelAttributeDisable
#define MAP_uDMAChannelAttributeDisable                                       \
        ROM_uDMAChannelAttributeDisable
#else
#define MAP_uDMAChannelAttributeDisable                                       \
        uDMAChannelAttributeDisable
#endif
#ifdef ROM_uDMAChannelAttributeGet
#define MAP_uDMAChannelAttributeGet                                           \
        ROM_uDMAChannelAttributeGet
#else
#define MAP_uDMAChannelAttributeGet                                           \
        uDMAChannelAttributeGet
#endif
#ifdef ROM_uDMAChannelControlSet
#define MAP_uDMAChannelControlSet                                             \
        ROM_uDMAChannelControlSet
#else
#define MAP_uDMAChannelControlSet                                             \
        uDMAChannelControlSet
#endif
#ifdef ROM_uDMAChannelSizeGet
#define MAP_uDMAChannelSizeGet                                                \
        ROM_uDMAChannelSizeGet
#else
#define MAP_uDMAChannelSizeGet                                                \
        uDMAChannelSizeGet
#endif
#ifdef ROM_uDMAChannelModeGet
#define MAP_uDMAChannelModeGet                                                \
        ROM_uDMAChannelModeGet
#else
#define MAP_uDMAChannelModeGet                                                \
        uDMAChannelModeGet
#endif
#ifdef ROM_uDMAChannelSelectSecondary
#define MAP_uDMAChannelSelectSecondary                                        \
        ROM_uDMAChannelSelectSecondary
#else
#define MAP_uDMAChannelSelectSecondary                                        \
        uDMAChannelSelectSecondary
#endif
#ifdef ROM_uDMAChannelSelectDefault
#define MAP_uDMAChannelSelectDefault                                          \
        ROM_uDMAChannelSelectDefault
#else
#define MAP_uDMAChannelSelectDefault                                          \
        uDMAChannelSelectDefault
#endif
#ifdef ROM_uDMAIntStatus
#define MAP_uDMAIntStatus                                                     \
        ROM_uDMAIntStatus
#else
#define MAP_uDMAIntStatus                                                     \
        uDMAIntStatus
#endif
#ifdef ROM_uDMAIntClear
#define MAP_uDMAIntClear                                                      \
        ROM_uDMAIntClear
#else
#define MAP_uDMAIntClear                                                      \
        uDMAIntClear
#endif
#ifdef ROM_uDMAControlAlternateBaseGet
#define MAP_uDMAControlAlternateBaseGet                                       \
        ROM_uDMAControlAlternateBaseGet
#else
#define MAP_uDMAControlAlternateBaseGet                                       \
        uDMAControlAlternateBaseGet
#endif
#ifdef ROM_uDMAChannelScatterGatherSet
#define MAP_uDMAChannelScatterGatherSet                                       \
        ROM_uDMAChannelScatterGatherSet
#else
#define MAP_uDMAChannelScatterGatherSet                                       \
        uDMAChannelScatterGatherSet
#endif
#ifdef ROM_uDMAChannelAssign
#define MAP_uDMAChannelAssign                                                 \
        ROM_uDMAChannelAssign
#else
#define MAP_uDMAChannelAssign                                                 \
        uDMAChannelAssign
#endif

